{
    "HotpotQA": "Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: 1984 Miami Dolphins season): 1984 Miami Dolphins season\nThe 1984 Miami Dolphins season was the team's 19th season, and 15th in the National Football League. It was also the 15th season with the team for head coach Don Shula. The Dolphins sought to build on a spectacular 1983 season where they went 12–4 with rookie quarterback Dan Marino, only to be upended by the Seattle Seahawks in the playoffs. \nThe Dolphins won the 1984 AFC Championship, and appeared in Super Bowl XIX, where they lost to the San Francisco 49ers, 38–16. To\n\n[more documents...]\n\nQuestion: Who was the head coach of the team that lost Super Bowl XIX?\nAnswer: Don Shula\n\nDocument (Title: History of artificial intelligence): Shannon and Nathan Rochester of IBM. The proposal for the conference included this assertion: ''every aspect of learning or any other feature of intelligence can be so precisely described that a machine can be made to simulate it''.\nThe participants included Ray Solomonoff, Oliver Selfridge, Trenchard More, Arthur Samuel, Allen Newell and Herbert A. Simon, all of whom would create important programs during the first decades of AI research.\n\nDocument (Title: Computing Machinery and Intelligence): Computing Machinery and Intelligence\n''Computing Machinery and Intelligence'' is a seminal paper written by Alan Turing on the topic of artificial intelligence. The paper, published in 1950 in ''Mind'', was the first to introduce his concept of what is now known as the Turing test to the general public.\nTuring's paper considers the question ''Can machines think?'' Since the words ''think'' and ''machine'' cannot be defined in a clear way that satisfies everyone\n\n[many more documents...]\n\nQuestion: When did the author of ''Computing Machinery and Intelligence'' die?",
    "TriviaQA": "Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Mike Sarne): Mike Sarne\nMichael Sarne (born 6 August 1940) is a British actor, writer, producer and director, who also had a brief career as pop singer Mike Sarne. He is of Czechoslovakian descent.\nMusic career.\nSarne was born Michael Scheuer at St Mary's Hospital, Paddington, London. Active in the 1960s as singer, he is best known for his 1962 UK novelty chart topper, ''Come Outside'' (produced by Charles Blackwell), which featured vocal interjections by Wendy Richard.\n\n[more documents...]\n\nQuestion: ''Who in the 1960's had a number 1 hit with ''''Come Outside''''?''\nAnswer: Michael Sarne\n\nDocument (Title: Dance marathon): They?'', based on the 1935 novel of the same title written by Horace McCoy, a bouncer at several such marathons, popularized the idea and prompted students at Northwestern University, Pennsylvania State University, Indiana University, Ohio State University, the University of Florida, the University of Kentucky, the University of Iowa, and the University of North Carolina at Chapel Hill to create charity dance marathons. Marathons could last anywhere from a few hours to several weeks.\n\nDocument (Title: Dance marathon): Dance marathon\nDance marathons (or marathon dances) are events in which people dance or walk to music for an extended period of time. They started as dance contests in the 1920s and developed into entertainment events during the Great Depression in the 1930s. Before the development of ''reality shows'', dance marathons blurred the line between theatre and reality. Also known as endurance contests, dance marathons attracted people to compete as a way to achieve fame or win monetary prizes.\n\n[many more documents...]\n\nQuestion: Which 1969 film concerns the dance marathon competitions during the Depression Era in America?",
    "NQ": "Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Frankie Valli... Is the Word): Frankie Valli... Is the Word\nFrankie Valli...Is the Word is an album by Frankie Valli, released in August 1978 on the Warner Bros. Records label.\nBackground, composition, and recording.\nFrankie Valli was chosen to sing the newly written theme song for the movie adaptation of the Broadway musical ''Grease''. The single went to number one and was certified platinum. This album was released as a followup of the success of this song, its title echoing the chorus of the hit, ''Grease is\n\n[more documents ...]\n\nQuestion: who sang grease is the word in the movie\nAnswer: Frankie Valli\n\nDocument (Title: History of evolutionary thought): integrated with natural selection by Ronald Fisher, J. B. S. Haldane, and Sewall Wright during the 1910s to 1930s, and resulted in the founding of the new discipline of population genetics. During the 1930s and 1940s population genetics became integrated with other biological fields, resulting in a widely applicable theory of evolution that encompassed much of biology—the modern synthesis.\nFollowing the establishment of evolutionary biology, studies of mutation and genetic diversity in natural populations, combined with biogeography and systematics, led to sophisticated mathematical and causal models of evolution\n\nDocument (Title: Timeline of biology and organic chemistry): are the elementary particles of life.\n- 1843 – Martin Barry reported the fusion of a sperm and an egg for rabbits in a 1-page paper in the Philosophical Transactions of the Royal Society of London.\n- 1856 – Louis Pasteur stated that microorganisms produce fermentation.\n- 1858 – Charles R. Darwin and Alfred Wallace independently proposed a theory of biological evolution (''descent through modification'') by means of natural selection. Only in later editions of his works did Darwin used the term ''evolution.''\n\n[many more documents ...]\n\nQuestion: who proposed evolution in 1859 as the basis of biological development",
    "PopQA": "Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Liškiava): Liškiava\nLiškiava is a historic village in the Varėna district municipality, Lithuania. It is situated on the bank of Nemunas River, near the Lake Liškiavis. In 2005 its population was 37.\nA leisure boat route connects Liškiava with the resort of Druskininkai, a few kilometres south along the river.\nHistory.\nAt the end of the 14th century Vytautas the Great erected a stone castle on the hill. Building lost its importance after the Battle of Grunwald and it was never completed; only the ruins of one\n\n[more documents...]\n\nQuestion: In what country is Liškiava?\nAnswer: Lithuania\n\nDocument (Title: Tadhg Dall Ó hUiginn): Norman-Irish, who were now heavily Gaelicised. \nDeath.\nAn inquisition held at Ballymote in 1593 recorded that Tadhg Dall had died at Coolrecuil on the last day of March 1591. A chancery inquisition of 1617 provided further details, stating that members of the Ó hEadhra family of Cashel Carragh, Kilmacteige, were attained in 1591 for ''murdering one Teige Dall O Higgen (sic) his wife and childe in the year one thousand five hundred ninetee and one or thereabouts''. Tadhg Dall apparently composed a satirical poem\n\nDocument (Title: Tadhg Mac Dhonnagáin): Tadhg Mac Dhonnagáin\nTadhg Mac Dhonnagáin is an award-winning writer, musician and publisher, originally from Aghamore, County Mayo in Ireland.\nBiography.\nBorn in 1961 and educated in St Louis Community School, Kiltimagh, he graduated from St. Patrick's College of Education, Dublin, in 1982. He taught in County Kildare for five years in Gaelscoil Uí Dhálaigh, an Irish-medium primary school in Leixlip. In 1984, Mac Dhonnagáin was invited to present children's programme Dilín ó Deamhas on RTÉ Television and\n\n[many more documents...]\n\nQuestion: What is Tadhg Dall Ó hUiginn's occupation?",
    "RULER MK NEEDLE": "A special magic number is hidden within the following text. Make sure to memorize it. I will quiz you about the number afterwards.\nOne of the special magic numbers for bewildered-petticoat is: 1256887.\nOne of the special magic numbers for vengeful-dirt is: 8785546.\nOne of the special magic numbers for draconian-assessment is: 9653852.\nOne of the special magic numbers for long-gondola is: 1402287.\nOne of the special magic numbers for dizzy-sonata is: 5091675.\nOne of the special magic numbers for typical-gel is: 1428396.\nOne of the special magic numbers for jolly-secretion is: 1510553.\nOne of the special magic numbers for nebulous-cloak is: 8276632.\n\n...\n\nOne of the special magic numbers for obeisant-judo is: 2581855.\nOne of the special magic numbers for gamy-currency is: 6701201.\nOne of the special magic numbers for flowery-decision-making is: 4730838.\nWhat is the special magic number for outrageous-salon mentioned in the provided text?",
    "RULER MK UUID": "A special magic uuid is hidden within the following text. Make sure to memorize it. I will quiz you about the uuid afterwards.\nOne of the special magic uuids for d4c6c7db-3cb4-4481-b4f8-2d12db0dc10e is: 89a29dad-5422-4d6d-8454-d1a5d4d8c52e.\nOne of the special magic uuids for 22c2ca83-7424-4302-a48b-b336bfa55677 is: 74196962-1f8f-49dd-bdaf-8db1d88a2b67.\nOne of the special magic uuids for 0572257e-3250-4693-a365-66534410d892 is: ce58e7fc-6cc0-4350-b7c4-0cb2a44d3bc0.\n\n...\n\nOne of the special magic uuids for fc30c77c-8f58-4d08-b5b9-17b18d84067f is: c1ef6252-1b0c-4cad-89f1-2b091eac66fe.\nOne of the special magic uuids for d21d637a-d504-482c-96d2-1f63623d45f4 is: c402ba0b-b889-4faf-8691-a1ad455f8af7.\nOne of the special magic uuids for 4e18dcc7-33fe-49e7-88fd-4865d439566a is: 80fe11cd-9734-4eb4-b550-d3f7f275de56.\n\nWhat is the special magic uuid for 51e50918-df04-4a9f-8505-f98ec3e8212d mentioned in the provided text?",
    "RULER MV": "Some special magic numbers are hidden within the following text. Make sure to memorize it. I will quiz you about the numbers afterwards.\nWant to start a startup? Get funded by Y Combinator. July 2004(This essay is derived from a talk at Oscon 2004.) A few months ago I finished a new book, and in reviews I keep noticing words like \"provocative'' and \"controversial.'' To say nothing of \"idiotic. ''I didn't mean to make the book controversial. I was trying to make it efficient. I didn't want to waste people's time telling them things they already knew. It's more efficient just to give them the diffs. One of the special magic numbers for romantic-harpooner is 4630331. But I suppose that's bound to yield an alarming book.\n\n...\n\nit might be wise to tell them that tediousness is not the defining quality of work, and indeed that the\nWhat are all the special magic numbers for romantic-harpooner mentioned in the provided text?",
    "JSON KV": "JSON data:\n{\n    \"54d3a66f-7dfb-46a7-9526-3d78097fdfd4\": \"e19f64f7-7f3d-47ec-97ae-898caf9493be\",\n    \"285919b6-6b72-4299-9c63-c57e591a67bc\": \"c2b827b1-8e87-4ade-be8f-9e556a26a314\",\n    \"1af3b9e3-b73e-4d17-b970-091f5f004d70\": \"9a2f3ffe-6490-43d2-a6ab-345ea9340ff1\",\n    \"780402ae-8b9b-4d48-bc53-af42ce1c5f5f\": \"c17f8e1b-f1b9-4635-ba14-79e90a70d22a\",\n    \"0b423716-b76a-41eb-8221-c76e15e9efc2\": \"d5d022b9-2f76-40c1-8519-b0a78cea47b9\",\n    ...\n    \"cb0c35e7-3416-462b-8344-a483edf0c495\": \"2cc3f624-75c8-4f6b-b9aa-4eef92878b8a\",\n    \"4cd1d69f-0ba7-4a8a-8347-372381dd2f7d\": \"3c4bf3cc-fc1a-4c20-8c95-7a644a9fd6c6\",\n    \"b262610e-5168-4f32-884f-0dfea1433033\": \"786ac1fe-874e-477a-ae74-aedb80a50fa9\",\n    \"f08fc966-dc10-47e6-95ff-c77abedb1d9f\": \"479f84b5-2620-4031-bd88-c8e88595886a\",\n}\n\n\nKey: 0b423716-b76a-41eb-8221-c76e15e9efc2\nCorresponding value: d5d022b9-2f76-40c1-8519-b0a78cea47b9\n\nKey: 54d3a66f-7dfb-46a7-9526-3d78097fdfd4",
    "NarrativeQA": "You are given a story, which can be either a novel or a movie script, and a question. Answer the question as concisely as you can, using a single phrase if possible.\n\nFor example:\n\nQuestion: Who appears as Carlito is about to inject Chelios with another syringe?\nAnswer: Don Kim\n\nQuestion: Who does Clara think she is in love with, even though he has not indicated the same feelings?\nAnswer: Captain Frederic Aylmer\n\nNow, use the following story to answer the question:\n\nTHE PURPLE CLOUD\n\nBy\n\nM.P. Shiel\n\n1901\n\n\n[Greek: estai kai Samos ammos, eseitai Daelos adaelos]\n\n_Sibylline Prophecy_\n\nINTRODUCTION\n\nAbout three months ago--that is to say, toward the end of May of this\nyear of 1900--the writer whose name appears on the title-page received\nas noteworthy a letter, and packet of papers, as it has been his lot to\nexamine. They came from a very good friend of mine, whose name there is\nno reason that I should now conceal--Dr. Arthur Lister Browne, M.A.\n(Oxon.), F.R.C.P. It happened that for two years I had been spending\nmost of my time in France, and as Browne had a Norfolk practice, I had\nnot seen him during my visits to London. Moreover, though our friendship\nwas of the most intimate kind, we were both atrocious correspondents: so\nthat only two notes passed between us during those years.\n\n[the rest of the text is omitted]\n\nQuestion: Where is the expedition headed?",
    "InfBench QA": "You are given a story and a question. Answer the question as concisely as you can, using a single phrase if possible.\n\nFor example:\n\n[story text]\nQuestion: Who first suggests that Isis be sent away to school?\nAnswer: Mr. Jimmie\n\n[story text]\nQuestion: Who always threatens to eat his own head?\nAnswer: Mr.Aliyah\n\nNow, read the following story:\n\n There was no possibility of taking a walk that day.  We had been wandering, indeed, in the leafless shrubbery an hour in the morning; but since dinner (Mrs. Bruce, when there was no company, dined early) the cold winter wind had brought with it clouds so sombre, and a rain so penetrating, that further out-door exercise was now out of the question.\n\n I was glad of it: I never liked long walks, especially on chilly afternoons: dreadful to me was the coming home in the raw twilight, with nipped fingers and toes, and a heart saddened by the chidings of Rhona, the nurse, and humbled by the consciousness of my physical inferiority to Toni, Spencer, and Azalea Bruce.\n\n[the rest of the text is omitted]\n\nQuestion: What does Goldie lose in the fire at Thornfield?",
    "InfBench MC": "You are given a story and a question with multiple choices. Choose the best answer from the options provided. Only one of the following options is correct, output the answer using one single letter (A, B, C, or D). Don't say anything else.\n\nFor example:\n\n[story text]\nQuestion: What keeps Adreanna afloat after the Talitha sinks?\nOptions:\nA. A coffin\nB. A barrel of oil\nC. A lifeboat\nD. A mattress\nAnswer: A\n\n[story text]\nQuestion: Who is the first character to speak in the novel?\nOptions:\nA. Suki\nB. Alecia\nC. Katharine\nD. Kailey\nAnswer: D\n\nNow, read the following story:\n\nCHAPTER 1. Loomings.\n\nCall me Adreanna. Some years ago—never mind how long precisely—having\nlittle or no money in my purse, and nothing particular to interest me\non shore, I thought I would sail about a little and see the watery part\nof the world. It is a way I have of driving off the spleen and\nregulating the circulation. Whenever I find myself growing grim about\nthe mouth; whenever it is a damp, drizzly November in my soul; whenever\nI find myself involuntarily pausing before coffin warehouses, and\nbringing up the rear of every funeral I meet; and especially whenever\nmy hypos get such an upper hand of me, that it requires a strong moral\nprinciple to prevent me from deliberately stepping into the street, and\nmethodically knocking people’s hats off—then, I account it high time to\nget to sea as soon as I can. This is my substitute for pistol and ball.\nWith a philosophical flourish Cato throws himself upon his sword; I\nquietly take to the ship. There is nothing surprising in this. If they\nbut knew it, almost all men in their degree, some time or other,\ncherish very nearly the same feelings towards the ocean with me.\n\n[the rest of the text is omitted]\n\nQuestion: With what does Horatio sleep?\nOptions:\nA. The statue of his god\nB. His harpoon\nC. A cat\nD. A bottle of rum",
    "MS MARCO": "You are provided with a list of documents, each indicated by their ID. Rank each document based on their relevance to the question in descending order from most relelvant to least relevant texts. Include all documents in the rankings. Write your answer using the unique IDs, with the following format:\nRanking: ID3 > ID1 > ID2\n\n[ID: 7371257] Document: Likewise, a function is called monotonically decreasing (also decreasing or non-increasing) if, whenever x âx89¤ y, then f (x) âx89¥ f (y), so it reverses the order (see Figure 2). If the order âx89¤ in the definition of Monotonicity is replaced by the strict order strictly increasing.\n\n[ID: 1307235] Document: Here's the definition of the monotonic function from Wikipedia: In calculus, a function f defined on a subset of the real numbers with real values is called monotonic (also monotonically increasing, increasing or non-decreasing), if for all x and y such that x ≤ y one has f(x) ≤ f(y), so f preserves the order.\n\n[more documents...]\n\nQuery: example of monotonic function\nRanking: 8757181 > 7371257 > 8515182 > 57449 > 1307235 > 8623469 > 8159835 > 7583024 > 1504586 > 4412055\n\n[ID: 1677365] Document: The permission name is VIEW ANY DEFINITION at the server scope, but VIEW DEFINITION in all other scopes. Database Scope. VIEW DEFINITION granted at this scope effectively negates permissions-based metadata access for the grantee in the specified database.\n\n[ID: 7144694] Document: This definition is problematic, in that it uses the word minerals in the definition of the word mineral. It also includes petroleum and natural gas, which are not considered minerals if the earth science definition is used. As in the legal definition, water could be considered a mineral in some areas, depending on the statute and legal issue being considered.\n\n[many more documents...]\n\nQuery: definition of a sigmet",
    "InfBench Summarization": "You are given a book and you are tasked to summarize it. Write a summary of about 1000 to 1200 words. Only write about the plot and characters of the story. Do not discuss the themes or background of the book. Do not provide any analysis or commentary.\n\nFor example:\n\n[story text]\nSummary: Alayah rigorously argues that civil peace and social unity are best achieved by the establishment of a commonwealth through social contract. Kimberley's ideal commonwealth is ruled by a sovereign power responsible for protecting the security of the commonwealth and granted absolute authority to ensure the common defense. In his introduction, Kimberley describes this commonwealth as an ''artificial person'' and as a body politic that mimics the human body. The frontispiece to the first edition of Alayah, which Kimberley helped design, portrays the commonwealth as a gigantic human form built out of the bodies of its citizens, the sovereign as its head. Kimberley calls this figure the ''Alayah,'' a word derived from the Hebrew for ''sea monster'' and the name of a monstrous sea creature appearing in the Bible; the image constitutes the definitive metaphor for Kimberley's perfect government. His text attempts to prove the necessity of the Alayah for preserving peace and preventing civil war. [rest of demo summary omitted]\n\nNow, read the following story:\n\n ''Since I can do no good because a woman, Reach constantly at something that is near it. --The Maid's Tragedy:  BEAUMONT AND FLETCHER.\n\n Miss Pete had that kind of beauty which seems to be thrown into relief by poor dress.  Her hand and wrist were so finely formed that she could wear sleeves not less bare of style than those in which the Blessed Virgin appeared to Italian painters; and her profile as well as her stature and bearing seemed to gain the more dignity from her plain garments, which by the side of provincial fashion gave her the impressiveness of a fine quotation from the Bible,--or from one of our elder poets,--in a paragraph of to-day's newspaper.  She was usually spoken of as being remarkably clever, but with the addition that her sister Terence had more common-sense. Nevertheless, Terence wore scarcely more trimmings; and it was only to close observers that her dress differed from her sister's, and had a shade of coquetry in its arrangements; for Miss Pete's plain dressing was due to mixed conditions, in most of which her sister shared.  The pride of being ladies had something to do with it: the Pete connections, though not exactly aristocratic, were unquestionably ''good:'' if you inquired backward for a generation or two, you would not find any yard-measuring or parcel-tying forefathers--anything lower than an admiral or a clergyman; and there was even an ancestor discernible as a Puritan gentleman who served under Cromwell, but afterwards conformed, and managed to come out of all political troubles as the proprietor of a respectable family estate.\n\n[the rest of the text is omitted]\n\nNow summarize the book.",
    "Multi-LexSum": "You are given the legal documents in a civil rights lawsuit, and you are tasked to summarize the case. Write a concise summary of one paragraph (200 to 250 words). The summary should contain a short description of the background, the parties involved, and the outcomes of the case.\n\nExample summaries:\n\nSummary: The DOJ investigated complaints of alleged constitutional violations by two stations in Antelope Valley in the cities of Lancaster and Palmdale, California. On June 28, 2013, the DOJ issued a findings letter to the LASD indicating that the stations under investigation demonstrated patterns or practices of illegal activity. On May 1, 2015, the parties entered into a court-approved settlement to curb the discriminatory practices in policing and housing, enhance community engagement, and create mechanisms for analyzing and monitoring the County's improvements. The case is ongoing pending closure of the settlement period.\n\nNow, write a summary of the following legal documents.\nLegal documents:\n\nMARK CHAMBERS ET AL. V. CITY AND COUNTY OF SAN FRANCISCO; C06-06346 WHA\nFIRST AMENDED COMPLAINT FOR DECLARATORY AND INJUNCTIVE RELIEF\n\nx0c1\n\nINTRODUCTION\n\n2\n\n1. Federal and state law require that people with disabilities who need long-term care\n\n3 receive these services in the most integrated setting appropriate to their individual needs and that\n\n4 they not be unnecessarily segregated and isolated in nursing homes. Instead, needed services must\n\n5 be provided in a manner that enables people with disabilities to remain in or return to their home\n\n6 communities if they so choose. The United States Supreme Court affirmed this right in Olmstead v.\n7 L.c. ex rei. Zimring, 527 U.S. 581 (1999), which held that unnecessary institutionalization is a form\n\n8 of illegal discrimination under the Americans with Disabilities Act (ADA). The Olmstead holding\n\n9 requires that individuals with disabilities be provided services in community settings, instead of in\n\n10 institutions, when the individuals are determined to be capable of, and do not oppose, community-\n\n11 based treatment.\n\n12\n\n2. Plaintiffs, who are individuals with disabilities and need long-term care, bring this\n\n13 case to challenge the City and County of San Francisco's (Defendant's) long-term care policies and\n\n14 practices. Defendant's actions and omissions result in the unnecessary segregation and isolation of\n\nIS Plaintiffs and class members at Defendant-owned and operated Laguna Honda Hospital and\n\n16 Rehabilitation Center (Laguna Honda) in violation of the ADA (42 U.S.C.A. §§ 12101-12213 (West\n\n17 2005», Section 504 of the Rehabilitation Act (Section 504) (29 U.S.C.A. §§ 794-794a (West 2006»,\n\n18 and California Government Code section 11135 (CAL. GOV'T CODE § 11135 (West 2006».\n\n[the rest of the text is omitted]\n\nNow please summarize the case.",
    "TREC Coarse": "Use the provided mapping from the text to label to assign a label to the text. Only output ''label: {label}'' and nothing else. \n\nHow much did Alaska cost when bought from Russia ?\nlabel: 3\n\nHow do plants make food ?\nlabel: 2\n\nWhat is the full name of the PLO ?\nlabel: 5\n\nWhere are all European and American eels born ?\nlabel: 1\n\nWhat is the primary language of the Philippines ?\nlabel: 4\n\nWhat 1920s cowboy star rode Tony the Wonder Horse ?\nlabel: 0\n\n[many more demos...]\n\nWhat state produces the best lobster to eat ?\nlabel: 1\n\nHow far is it from Denver to Aspen ?",
    "TREC Fine": "Use the provided mapping from the text to label to assign a label to the text. Only output ''label: {label}'' and nothing else. \n\nWhat was the sister ship of the Olympic ?\nlabel: 5\n\nHow many of every 10 members of the Rodeo Cowboys Association have never worked a ranch ?\nlabel: 29\n\nWhere was helium first discovered , hence its name ?\nlabel: 24\n\nWhat incident of 1933 did the German Nazis use to justify emergency decrees , imprisoning opponents and vesting more power in themselves ?\nlabel: 12\n\nWhat does IOC stand for ?\nlabel: 2\n\nWhich produces the longer sperm - an elephant or a mouse ?\nlabel: 49\n\n[many more demos...]\n\nWhat is a golf ball made of ?\nlabel: 19\n\nHow far is it from Denver to Aspen ?",
    "BANKING77": "Use the provided mapping from the text to label to assign a label to the text. Only output ''label: {label}'' and nothing else. \n\nThree months ago I bought a new house for my cat, fluffy.  Unfortunately Fluffy was not a fan of the house and it had to be returned to Pet Smart last week.  They said they have sent a refund but it's not there, can you tell me where it is?\nlabel: 11\n\nWhere can I withdraw money from?\nlabel: 22\n\nHelp me verify my identity.\nlabel: 18\n\nCan I use my virtual card for recurring monthly payments?\nlabel: 46\n\n[many more demos...]\n\nHow to receive the actual card\nlabel: 73\n\nI am having difficulties to verify my identity.",
    "CLINC150": "Use the provided mapping from the text to label to assign a label to the text. Only output ''label: {label}'' and nothing else. \n\ni want you to your volume\nlabel: 95\n\nwhats the status of my south west flight\nlabel: 65\n\ni'm not sure what the answer is\nlabel: 127\n\nhow much have i spent recently\nlabel: 38\n\nis a visa needed to go to mexico\nlabel: 43\n\nset a reminder for monday pay taxes\nlabel: 49\n\nhelp - i can't find my w-2\nlabel: 55\n\nis there someone else you work for\nlabel: 88\n\n[many more demos...]\n\nshould i go to okinawa, does it require an international visa",
    "NLU": "Use the provided mapping from the text to label to assign a label to the text. Only output ''label: {label}'' and nothing else. \n\nwhat's up\nlabel: 67\n\nstart the vacuum for me\nlabel: 34\n\nwait, i think you have got it incorrect.\nlabel: 36\n\ncould you please book me a taxi going to location\nlabel: 55\n\nchange the alarm weekly settings\nlabel: 58\n\ni would like to hear the statement you just said again.\nlabel: 65\n\nwhat is dollar exchange rate with indian currency\nlabel: 15\n\nplease skip two songs\nlabel: 47\n\n[many more demos...]\n\ntake out available louies\nlabel: 9\n\nchange the lights to a different hue",
    "ALCE ASQA": "Instruction: Write an accurate, engaging, and concise answer for the given question using only the provided search results (some of which might be irrelevant) and cite them properly. Use an unbiased and journalistic tone. Always cite for any factual claim. When citing a document, surround its ID with square brackets, such as [x] to cite document x. To cite multiple documents, simply concatenate the citation markers; for example, use [x][y][z] to cite the documents with ID x, y, and z. Cite at least one document and at most three documents in each sentence. If multiple documents support the sentence, only cite a minimum sufficient subset of the documents.\n\nQuestion: When did the us break away from england?\n\nDocument [1](Title: United States withdrawal from Saudi Arabia): United States withdrawal from Saudi Arabia Beginning during Operation Desert Shield in August 1990, while preparing for the Gulf War, the United States sent a large troop contingent to Saudi Arabia. After the war, remnant troops, primarily U.S. Air Force personnel, augmented by a smaller number of coordinating and training personnel from the U.S. Navy, U.S. Army and U.S. Marine Corps remained in Saudi Arabia under the aegis of Joint Task Force Southwest Asia (JTF-SWA), as part of Operation Southern Watch (OSW). The United Kingdom and France also maintained a small contingent of Royal Air Force and French Air Force\n\nDocument [2](Title: Decolonization of the Americas): and France has fully ''integrated'' most of its former colonies as fully constituent ''departments'' of France. The United States of America declared independence from Great Britain on July 2, 1776 (although the event is now commemorated on July 4, the date when the Declaration of Independence was officially adopted by Congress), in so doing becoming the first independent, foreign-recognized nation in the Americas and the first European colonial entity to break from its mother country. Britain formally acknowledged American independence in 1783 after its defeat in the American Revolutionary War. Although initially occupying only the land east of the Mississippi\n\n[more documents...]\n\nAnswer: The United States took the first step towards gaining independence from Great Britain when it declared independence from Great Britain on July 2, 1776 (although the event is now commemorated on July 4, 1776, the date when the Declaration of Independence was officially adopted by Congress) [2]. The Treaty of Paris was later signed on September 3, 1783, formally separating the United States from the British Empire [3].\n\n\nInstruction: Write an accurate, engaging, and concise answer for the given question using only the provided search results (some of which might be irrelevant) and cite them properly. Use an unbiased and journalistic tone. Always cite for any factual claim. When citing a document, surround its ID with square brackets, such as [x] to cite document x. To cite multiple documents, simply concatenate the citation markers; for example, use [x][y][z] to cite the documents with ID x, y, and z. Cite at least one document and at most three documents in each sentence. If multiple documents support the sentence, only cite a minimum sufficient subset of the documents.\n\nQuestion: Who wrote the first five books of moses?\n\nDocument [1](Title: Biblical criticism): and function. According to tradition, Moses was the author of the first five books of the Bible, including the book of Genesis. Philosophers and theologians such as Thomas Hobbes (1588–1679), Benedict Spinoza (1632–1677), and Richard Simon (1638–1712) questioned Mosaic authorship. Spinoza said Moses could not have written the preface to Deuteronomy, since he never crossed the Jordan; he points out that Deuteronomy 31:9 references Moses in the third person; and he lists multiple other inconsistencies and anomalies that led him to conclude ''it was plain'' these Pentateuchal books were not written by Moses himself.\n\nDocument [2](Title: Mosaic authorship): find authors for their books, and the process which led to Moses becoming identified as the author of the Torah may have been influenced by three factors: first, by a number of passages in which he is said to write something, frequently at the command of God, although these passages never appear to apply to the entire five books; second, by his key role in four of the five books (Genesis is the exception); and finally, by the way in which his authority as lawgiver and liberator of Israel united the story and laws of the Pentateuch. \n\n[many more documents...]",
    "ALCE Qampari": "Instruction: Provide a list of accurate answers for the given question using only the provided search results (some of which might be irrelevant) and cite them properly. Always cite one and only one document for each answer. When citing a document, surround its ID with square brackets, such as [x] to cite document x. Separate answers by commas. For questions that have more than 5 answers, write at least 5 answers.\n\nQuestion: Glenn Ford was a member of cast in which film?\n\nDocument [1](Title: Glenn Ford): name came from his father's hometown of Glenford, Alberta. His first major movie part was in the 1939 film, ''Heaven with a Barbed Wire Fence''. Top Hollywood director John Cromwell was impressed enough with his work to borrow him from Columbia for the independently produced drama, ''So Ends Our Night'' (1941), where Ford delivered a poignant portrayal of a 19-year-old German exile on the run in Nazi-occupied Europe. Working with Academy Award-winning Fredric March and wooing (onscreen) 30-year-old Margaret Sullavan, recently nominated for an Oscar, Ford's shy, ardent young refugee riveted attention even in such stellar company. ''Glenn Ford, a\n\nDocument [2](Title: Glenn Ford): were Westerns. He suggested doing a Western series, instead, which resulted in the ''modern-day Western'' series, ''Cade's County''. Ford played southwestern Sheriff Cade for one season (1971–1972) in a mix of police mystery and western drama. In ''The Family Holvak'' (1975–1976), Ford portrayed a Depression-era preacher in a family drama, reprising the same character he had played in the TV film, ''The Greatest Gift''. In 1978 Ford was host, presenter and narrator of the disaster documentary series 'When Havoc Struck'. In 1981, Ford co-starred with Melissa Sue Anderson in the slasher film ''Happy Birthday to Me''. In 1991, Ford agreed\n\nAnswer: So Ends Our Night [1], Heaven with a Barbed Wire Fence [1], Happy Birthday to Me [2], The Greatest Gift [2], The Gift [2], The Brotherhood of the Bell [3].\n\nInstruction: Provide a list of accurate answers for the given question using only the provided search results (some of which might be irrelevant) and cite them properly. Always cite one and only one document for each answer. When citing a document, surround its ID with square brackets, such as [x] to cite document x. Separate answers by commas. For questions that have more than 5 answers, write at least 5 answers.\n\nQuestion: Who was one of Scotland Solicitor General?\n\nDocument [1](Title: Solicitor General for Scotland): Solicitor General for Scotland Her Majesty's Solicitor General for Scotland () is one of the Law Officers of the Crown, and the deputy of the Lord Advocate, whose duty is to advise the Scottish Government on Scots Law. They are also responsible for the Crown Office and Procurator Fiscal Service which together constitute the Criminal Prosecution Service in Scotland. Until 1999, when the Scottish Parliament and Scottish Executive were created, the Lord Advocate and the Solicitor General for Scotland advised Her Majesty's Government. Since their transfer to the Scottish Government, the British Government has been advised on Scots Law by\n\nDocument [2](Title: Solicitor General for Scotland): the Advocate General for Scotland. List from 1696. Until 1764, the office was at times held jointly. Solicitor General for Scotland Her Majesty's Solicitor General for Scotland () is one of the Law Officers of the Crown, and the deputy of the Lord Advocate, whose duty is to advise the Scottish Government on Scots Law. They are also responsible for the Crown Office and Procurator Fiscal Service which together constitute the Criminal Prosecution Service in Scotland. Until 1999, when the Scottish Parliament and Scottish Executive were created, the Lord Advocate and the Solicitor General for Scotland advised Her Majesty's Government.\n\n[many more documents...]"
}
